app/views/scores/index.html.erb

          <td>
            <%= number_field_tag 'score-input' + i.to_s,
              (score.value == -2)? 0 : score.value,
              in: 0..@test.max_score, step: 0.01 %>
---
SELECT "scores".* FROM "scores"