app/views/courses/show.html.erb

SELECT "scores".* FROM "scores"
---
        <td><%= student['first_name'] + ' ' + student['last_name'] %></td>
        <% student['scores'].each do |score| %>