app/controllers/courses_controller.rb

SELECT "tests".* FROM "tests" INNER JOIN "test_courses" ON "test_courses"."test_id" = "tests"."id" WHERE (course_id = '1') ORDER BY "tests"."id" ASC
SELECT scores.* FROM "students" INNER JOIN "enrolls" ON "enrolls"."student_id" = "students"."id" INNER JOIN "scores" ON "scores"."student_id" = "students"."id" WHERE (course_id = '1')
SELECT scores.* FROM "students" INNER JOIN "scores" ON "scores"."student_id" = "students"."id"
SELECT "scores".* FROM "scores" INNER JOIN "students" ON "students"."id" = "scores"."student_id" WHERE "scores"."student_id" = ? ORDER BY "scores"."test_id" ASC  [["student_id", 7]]
---
  def show
    @tests = Test.joins(:test_course).where("course_id = ?", params[:id]).order(:id)
    @students = Student.joins(:enrolls).where("course_id = ?", params[:id]).as_json
    @students.each do |student|
      student['scores'] = Score.joins(:student).where(student_id: student['id']).order(:test_id).as_json

INSERT INTO "courses" ("year") VALUES (?)  [["year", 2015]]
---
  def create
    @course = Course.new(year: params[:course][:year])

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "year" = ? WHERE "courses"."id" = ?  [["year", 2018], ["id", 1]]
SELECT tests.*, test_courses.course_id FROM "tests" INNER JOIN "test_courses" ON "test_courses"."test_id" = "tests"."id" WHERE (test_courses.course_id = 1)
UPDATE "tests" SET "date" = ? WHERE "tests"."id" = ?  [["date", "2019-01-04 00:00:00"], ["id", 17]]
---
  def update
      respond_to do |format|
      if @course.update(year: params[:course][:year])
        Test.joins(:test_course).select('tests.*, test_courses.course_id').where('test_courses.course_id = ?', @course).each do |test|
          test.update(date: test.date.to_date.change(year: params[:course][:year].to_i))