app/controllers/enrolls_controller.rb

  def destroy
    course = Course.find(params[:course_id])
    TestCourse.of(course).each do |tc|
      Score.where( student_id: @enroll.student_id, test_id: tc.test_id).each do |score|
        score.destroy
---
SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ? AND "scores"."test_id" = ?  [["student_id", 3], ["test_id", 16]]
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 6]]