app/controllers/enrolls_controller.rb

  def create
    course = Course.find(params[:course_id])
    student = Student.find_by(dni: params[:student_id])
    @enroll = Enroll.new( student: student, course: course)
    Test.of(course).each do |test|
      @score = Score.new( student: student, test: test, value: -2)
    end

    respond_to do |format|
      if @enroll.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."dni" = ? LIMIT ?  [["dni", 39831181], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE (tests.course_id = 1)
INSERT INTO "enrolls" ("student_id", "course_id") VALUES (?, ?)  [["student_id", 1], ["course_id", 1]]

  def destroy
    course = Course.find(params[:course_id])
    @enroll.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "enrolls" WHERE "enrolls"."id" = ?  [["id", 1]]

    def set_enroll
      @enroll = Enroll.find(params[:id])
---
SELECT  "enrolls".* FROM "enrolls" WHERE "enrolls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]