app/controllers/scores_controller.rb

  def index
    @course = Course.find(params[:course_id])
    @test = Test.find(params[:test_id])
    @scores = Score.joins(:student)
      .select('scores.*, students.first_name, students.last_name')
      .where(test: @test)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT scores.*, students.first_name, students.last_name FROM "scores" INNER JOIN "students" ON "students"."id" = "scores"."student_id" WHERE "scores"."test_id" = 1

  def create
    course = Course.find(params[:course_id])
    test = Test.find(params[:test_id])
    respond_to do |format|
      begin
        puts params[:absent].nil?
        i = 0
        Score.where(test: test).each do |score|
          if !score.update(value: (params[:"absent#{i}"]? -2 : params[:"score-input#{i}"]))
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."test_id" = 1
UPDATE "scores" SET "value" = ? WHERE "scores"."id" = ?  [["value", -2.0], ["id", 1]]