app/controllers/students_controller.rb

INSERT INTO "students" ("last_name", "first_name", "email", "legajo", "dni", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    puts params[:student]
    hash = params[:student]
    @student = Student.new(
      last_name: params[:student][:last_name], first_name: params[:student][:first_name],
      email: params[:student][:email], dni: params[:student][:dni],
      legajo: params[:student][:legajo]
    )

    respond_to do |format|
      if @student.save