app/controllers/tests_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT tests.*, test_courses.course_id FROM "tests" INNER JOIN "test_courses" ON "test_courses"."test_id" = "tests"."id" WHERE (test_courses.course_id = 1)
---
  def index
    @course = Course.find(params[:course_id])
    @tests = Test.joins(:test_course).select('tests.*, test_courses.course_id').where('test_courses.course_id = ?', @course.id)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @test = Test.new
    @course = Course.find(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @course = Course.find(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "enrolls".* FROM "enrolls" WHERE "enrolls"."course_id" = ?  [["course_id", 1]]
INSERT INTO "scores" ("value", "student_id", "test_id") VALUES (?, ?, ?)  [["value", -2.0], ["student_id", 7], ["test_id", 21]]
INSERT INTO "tests" ("title", "date", "min_score", "max_score") VALUES (?, ?, ?, ?)  [["title", "examen 1"], ["date", "2018-01-30 00:00:00"], ["min_score", 10.0], ["max_score", 15.0]]
INSERT INTO "test_courses" ("course_id", "test_id") VALUES (?, ?)  [["course_id", 1], ["test_id", 16]]
---
  def create
    @test = Test.new(
      title: params[:test][:title], date: params[:test][:date],
      min_score: params[:test][:min_score], max_score: params[:test][:max_score]
    )

    @test_course = TestCourse.new(
      test: @test, course: Course.find(params[:course_id])
    )

    Enroll.where(course_id: params[:course_id]).each do |enroll|
      Score.create( student_id: enroll.student_id, test: @test, value: -2)
    end

    puts @test_course.as_json

    respond_to do |format|
      if @test.save && @test_course.save

UPDATE "tests" SET "min_score" = ? WHERE "tests"."id" = ?  [["min_score", 11.0], ["id", 17]]
---
  def update
    respond_to do |format|
      if @test.update(title: params[:test][:title], date: params[:test][:date],
        min_score: params[:test][:min_score], max_score: params[:test][:max_score])

SELECT "scores".* FROM "scores" WHERE "scores"."test_id" = 17
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 8]]
DELETE FROM "tests" WHERE "tests"."id" = ?  [["id", 19]]
---
  def destroy
    Score.where(test: @test).each do |score|
      score.destroy
    end
    @test.destroy